Revit 2027 API
BuiltInFailures.ElectricalFailures.CannotConnectDifferentDesignOptsObjects Property
 Cannot add or assign [Element] to circuit. Electrical objects belonging to different design options cannot be connected.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotConnectDifferentDesignOptsObjects { get; }
Public Shared ReadOnly Property CannotConnectDifferentDesignOptsObjects As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotConnectDifferentDesignOptsObjects {
	FailureDefinitionId^ get ();
}
static member CannotConnectDifferentDesignOptsObjects : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace